import streamlit as st

st.header("Online converter", divider="rainbow")
st.write(
    "Онлайн-инструмент для преобразования документов Office в PDF-файлы,\nпреобразования PDF-файлов в JPG и JPG в PDF, PDF в MP3 и MP3 в PDF\n без необходимости установки."
)

# 1. import streamlit as st
# Этот код импортирует библиотеку streamlit, которая позволяет создавать интерактивные веб-приложения.

# 2. st.header("Online converter", divider="rainbow")
# Функция header создает заголовок с текстом "Online converter" и добавляет разделитель в виде радуги.

# 3. st.write(
#     "Онлайн-инструмент для преобразования документов Office в PDF-файлы,\nпреобразования PDF-файлов в JPG и JPG в PDF, PDF в MP3 и MP3 в PDF\n без необходимости установки."
# )
# Функция write выводит текст на страницу. В данном случае, текст описывает функционал онлайн-конвертера, который может преобразовывать документы Office в PDF, PDF в JPG и JPG в PDF, а также PDF в MP3 и MP3 в PDF, и все это без необходимости установки какого-либо дополнительного программного обеспечения.
